Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/applying_to_college/application_procedures_and_entry_requirements.html.txt.tmx
Source language: en
Languages: ga

source: College application procedures and entrance requirements
ga: Córas iarratais agus riachtanais iontrála coláistí

source: You apply for almost all full-time undergraduate courses through the Central Applications Office (CAO)
ga: Cuireann tú isteach ar beagnach gach cúrsa lánaimseartha fochéime tríd an Lár-Oifig Iontrála (LOI)

source: The undergraduate courses in the universities and institutes of technology include Higher Certificates - Level 6, Ordinary Bachelor degrees - Level 7 and Honours Bachelor degrees - Level 8
ga: Is iad na cúrsaí lánaimseartha fochéime sna hollscoileanna agus institiúidí teicneolaíochta, Ardteastais - Leibhéal 6, Gnáthchéimeanna Baitsiléirí - Leibhéal 7 agus céimeanna Onóracha Baitsiléirí - Leibhéal 8.Tá tuilleadh faisnéise faoi na cáilíochtaí seo ar fáil inár ndoiciméad faoi oideachas tríú leibhéal in Éirinn

source: You can find more information about these qualifications in our document on third-level education in Ireland
ga: Níl aon chomhlacht lárnach iontrála ann i gcomhair cúrsaí Iar-Ardteistiméireachta

source: There is no central applications body for Post-Leaving Certificate (PLC) courses
ga: Ní mór do scoláirí iarratais a sheoladh go díreach chuig na coláistí aonair

source: The CAO provides a handbook that lists all the courses on offer and gives information on how to apply
ga: Cuireann an LOI pacáiste iarratais ar fáil le lámhleabhar a liostálann na cúrsaí ar fad a thairgítear agus a thugann eolas ar conas iarratas a dhéanamh

source: The closing date for 2017 applications from Irish and other European Union nationals is 5.15 pm on 1 February 2017
ga: Sé an dáta deiridh i gcomhair iarratas le haghaidh 2017 ó náisiúnaigh na hÉireann agus an Aontais Eorpaigh ná 5.15 i.n. ar an 1 Feabhra 2017

source: Late applications are allowed up to 5.15 pm on 1 May 2017
ga: Ceadófar iarratais dheireanacha suas go dtí 5.15 i.n. ar an 1 Bealtaine 2017

source: Decisions on offers of places are normally made in August and September, after the results of the Leaving Certificate have come out
ga: Is iondúil a dhéantar cinneadh ar thairiscintí ar áiteanna i mí Lúnasa agus mí Meán Fómhair, tar éis do thorthaí na hArdteistiméireachta teacht amach

source: A detailed schedule of the offer rounds is in the CAO handbook
ga: Tá mionsonraí na mbabhtaí tairiscintí sa lámhleabhar

source: It is possible to check and amend your online application free of charge up to 5.15 p.m
ga: Is féidir d'iarratas a sheiceáil, agus a athrú saor in aisce, suas go 5.15 i.n

source: From 6 February to 5.15 p.m
ga: Ina dhiaidh sin, is féidir leat athraithe a dhéanamh ón 6 Feabhra go dtí an 1 Márta

source: on 1 March, you can amend your course choices for a fee of €10
ga: Táille €10 a chosnaíonn an tseirbhís seo

source: There is a further chance to change your mind, free of charge, from 5 May to 5.15 p.m
ga: Tá seans eile agat chun d'iarratas a athrú, saor in aisce, ón 5 Bealtaine go dtí 5.15 i.n

source: on 1 July
ga: ar an 1 Iúil

source: EU applicants to undergraduate courses in medicine in 2017 must take the Health Professions Admissions Test (HPAT)
ga: Ní mór do iarratasóirí AE ar chúrsaí fochéime leighis (pdf) tabhairt faoin scrúdú Iontrála do Ghairmeacha Sláinte (HPAT)

source: There is more information on the HPAT-Ireland website
ga: Tá tuilleadh eolais ar an láithréan gréasáin HPAT-Ireland

source: You can find information about graduate entry programmes in medicine in 2017 on the CAO website
ga: Is féidir leat eolas maidir le cláir iontrála iarchéime sa mhíochaine a fháil ar an suíomh gréasáin LOI

source: Students who have taken the Leaving Certificate examination are allocated points for the results they get in their 6 best subjects at a single sitting of the Leaving Certificate
ga: Cuirtear pointí ar fáil do mhic léinn a bhfuil scrúdú na hArdteistiméireachta déanta acu ar son na dtorthaí a fhaigheann siad sa 6 ábhar is fearr a dhéanann siad, ag iarracht amháin den Ardteistiméireacht

source: The points awarded depend on the level of achievement in the subject
ga: Braitheann na pointí a bhronntar ar an leibhéal a ghnóthaíonn an mac léinn san ábhar

source: You can use the points calculator on qualifax.ie to work out what points are awarded for any particular set of results
ga: Is féidir an t-áireamhán ar qualifax.ie a úsáid chun na pointí a bhaineann le do thorthaí a ríomh

source: The number of entry-level points needed for any course depends on the number of places and the number of applicants for those places so the entry level varies from year to year
ga: Braitheann an méid pointí iontrála a theastaíonn d'aon chúrsa ar an méid áiteanna agus an líon iarrthóirí do na háiteanna sin agus mar sin athraíonn an leibhéal iontrála ó bhliain go bliain

source: Higher points are awarded for Higher-Level papers than for Ordinary-Level papers
ga: Tugtar pointí níos airde do na páipéir a dhéantar ag an Ardleibhéal ná páipéir ag an nGnáthleibhéal

source: Under a 4-year pilot scheme operated from Leaving Certificate 2012, the seven universities, Dublin Institute of Technology and the Royal College of Surgeons in Ireland allocate extra bonus points for Higher-Level mathematics
ga: Beidh treoirscéim i bhfeidhm ó Ardteistiméireacht na bliana 2012 sa chaoi go riarfaidh na 7 n-ollscoil, Institiúid Teicneolaíochta Bhaile Átha Cliath agus Coláiste Ríoga na Máinleá in Éirinn breis pointí do thorthaí Matamaitice ag an Ardleibhéal

source: The CAO publishes the minimum points required for admission to courses as each round of offers is made
ga: Foilsíonn an CAO íosmhéid na bpointí la haghaidh gach cúrsa chomh luath agus a dhéantar gach babhta tairiscintí

source: You can also check the points required in previous years
ga: Is féidir seiceáil na bpointí riachtanacha i mblianta roimhe freisin

source: A student must also have the particular academic entry requirements (also called matriculation requirements) for the course he or she wants to take
ga: Ní mór do scoláirí na riachtanais iontrála acadúla ar leith (ar a dtugtar riachtanais mháithreánacha freisin) a theastaíonn don chúrsa is mian leis nó léi a dhéanamh

source: You can find detailed information on the websites of the universities, institutes of technology and colleges of education
ga: Leigh tuilleadh eolais faoi na hollscoileanna, na hinstitiúid teicneolaíochta agus na coláistí oiliúna anseo

source: If you have a disability
ga: Má tá tú faoi mhíchumas

source: You may qualify for the Disability Access Route to Education (DARE) scheme, which aims to improve access to higher education for school-leavers with disabilities
ga: D'fhéadfá cáiliú le haghaidh scéim Bhealach Rochtana Míchumais ar Oideachas (DARE), atá dírithe ar fheabhas a chur ar rochtain ar an ardoideachas do lucht fágála scoile faoi mhíchumas

source: Higher Education Access Route (HEAR)
ga: Bealach Rochtana ar Ardoideachas (BRA)

source: The HEAR admissions scheme allocates a number of third-level places on a reduced points basis to school-leavers from socially disadvantaged backgrounds
ga: Dáileann scéim iontrála BRA roinnt áiteanna tríú leibhéal bunaithe ar phointí laghdaithe ar fhágálaithe scoile a bhfuil cúlra faoi mhíbhuntáiste acu

source: To be eligible for the scheme you must meet certain criteria related to your financial, social and cultural circumstances
ga: Chun a bheith incháilithe don scéim, caithfear critéir áirithe a chomhlíonadh i ndáil le cúinsí airgeadais, sóisialta agus cultúrtha

source: Read more in our document on the HEAR scheme
ga: Léigh tuilleadh inár gcáipéis ar an scéim BRA

source: National University of Ireland: The minimum entry requirement for the universities that are part of the National University of Ireland (NUI) is 6 Leaving Certificate subjects, including English and Irish
ga: Ollscoil Náisiúnta na hÉireann: 6 ábhar, Béarla, Gaeilge, agus teanga eile, san áireamh iad na bunriachtanais iontrála do na hollscoileanna atá mar pháirt d'Ollscoil Náisiúnta na hÉireann (ONÉ)

source: In 2 of these subjects, students must have achieved grade C at Higher Level
ga: Ní mór go mbeadh ar a laghad grád C ag an Ardleibhéal ag mac léinn i ndá ábhar acu seo ar a laghad

source: Most courses also require a third language
ga: Teastaíonn tríú teanga ón gcuid is mó de chúrsaí freisin

source: There may be additional course requirements, such as maths, for specific courses
ga: D’fhéadfadh go bhfuil riachtanais cúrsaí breise do chúrsaí áirithe, mar shampla matamaitic

source: University of Limerick: The minimum entry requirement is 6 Leaving Certificate subjects, including English and either Irish or another language
ga: Ollscoil Luimní: 6 ábhar, Béarla, Gaeilge, agus teanga eile, san áireamh iad na bunriachtanais iontrála d'Ollscoil Luimní

source: You must also have a pass in maths (Foundation Level is acceptable for some but not all courses)
ga: Caithfidh tú pas i matamaitic a bheith agat (glacfar Bonnleibhéal do chúrsaí áirithe ach ní ghlacfar do chúrsaí eile)

source: There may be additional course requirements for specific courses
ga: D’fhéadfadh go bhfuil riachtanais cúrsaí breise do chúrsaí áirithe

source: Trinity College Dublin: The minimum entry requirement is 6 Leaving Certificate subjects, with grade C on 3 Higher-Level papers and a pass in English, maths and another language
ga: Coláiste na Tríonóide: teastaíonn ar a laghad, 6 ábhar ó mhac léinn le grád C ar 3 pháipéar ag an Ardleibhéal agus pas sa Bhéarla, sa mhatamaitic agus i dteanga eile

source: Students can also have a combination of 6 subjects with grade C on 3 Higher-Level papers and a pass in English, Latin and another subject not a language
ga: Is féidir le mic léinn teaglaim 6 ábhar le grád C ar 3 pháipéar ag an Ardleibhéal agus pas sa Bhéarla Laidin agus ábhar eile nach teanga é, a bheith acu

source: Dublin City University: The minimum entry requirement is 6 Leaving Certificate subjects, with a grade C on 2 Higher-Level papers and a pass in maths and either English or Irish
ga: Ollscoil Chathair Átha Cliath: ní mór go mbeadh 6 ábhar Ardteistiméireachta ag na mic léinn ar fad a dhéanann iarratas ar áit in Ollscoil Chathair Átha Cliath le grád C ar dhá pháipéar Ardleibhéal agus pás sa mhatamaitic agus sa Bhéarla nó sa Ghaeilge

source: Each institute of technology can set its own entry requirements
ga: Is féidir gach institiúid teicneolaíochta a chuid riachtanais iontrála a shocrú

source: However, the general entry requirements for Level 6, 7 and 8 courses are set out below
ga: Áfach, tá na riachtanais ginearálta do chúrsaí leibhéal 6, 7 agus 8 leagtha síos seo leanas:

source: Level 8 (Honours Degree) courses: The minimum entry requirement is 6 Leaving Certificate subjects, with a grade C in 2 subjects at Higher Level and grade D in 4 other subjects, including maths and either Irish or English
ga: Cúrsaí leibhéal 8 (Céim Onórach): is iondúil go dteastaíonn íosmhéid de 6 ábhar Ardteistiméireachta, le grád C in 2 ábhar ag an Ardleibhéal agus grád D i 4 ábhar eile, ina measc mata agus Gaeilge nó Béarla

source: Levels 6 and 7 (Higher Certificate and Ordinary Degree): The minimum entry requirement is 5 Leaving Certificate subjects at grade D, including maths and either Irish or English
ga: Cúrsaí leibhéal 6 agus 7 (Ardteastas agus Bunchéim): 5 ábhar ghrád D san áireamh iad na bunriachtanais iontrála, ina measc mata agus Gaeilge nó Béarla

source: Colleges of education provide specialised training for primary school teachers
ga: Soláthraíonn coláistí oideachais sainoiliúint do mhúinteoirí bunscoile

source: They require a minimum of 3 grade Cs on Higher-Level papers, including Irish, and three grade Ds
ga: Teastaíonn ar a laghad 3 ghrád C ar pháipéir ag an Ardleibhéal, Gaeilge san áireamh agus 3 ghrád D

source: There are specific minimum grades for maths and English
ga: Tá bunghráid áirithe do mhatamaitic agus do Bhéarla

source: Places on Post-Leaving Certificate courses are not allocated on the basis of points, but applicants must be of Leaving Certificate standard
ga: Ní chuirtear na háiteanna ar chúrsaí IarArdteistiméireachta ar fáil ar bhonn pointí ach ní mór go mbeadh na hiarrathóirí de chaighdeán na hArdteistiméireachta

source: Most colleges interview candidates to determine their suitability
ga: Cuireann an chuid is mó coláistí agallamh ar na hiarrthóirí le fáil amach an bhfuil siad feiliúnach don chúrsa

source: There is a discounted fee of €25 for people applying online by 20 January 2017
ga: Tá ráta lascainithe €25 ann i leith iarratais ar líne roimh 20 Eanáir 2017

source: │Online discounted rate by 20 January │€25 │
ga: │Iarratas ar líne ráta lascainithe faoi 20 Eanáir│€25 │

source: │Paper or online application by 1 February │€40 │
ga: │Iarratas ar pháipéar agus ar líne faoi 1 Feabhra│€40 │

source: │Late online application by 1 May │€50 │
ga: │Iarratas déanach ar líne faoi 1 Bealtaine │€50 │

source: │Late paper application by 1 May │€80 │
ga: │Iarratas déanach ar pháipéar faoi 1 Bealtaine │€80 │

source: You can change your course choices online up to 31 January, free of charge
ga: Is féidir do roghanna cúrsaí a athrú ar líne saor in aisce suas go 31 Eanáir

source: Changes made from 6 February to 1 March cost €10
ga: Gearrtar táille €10 ar athrúcháin a dhéantar idir 6 Feabhra agus 1 Márta

source: The Change of Mind facility from 5 May to 1 July is free
ga: Tá an áis Athrú Intinne saor in aisce idir 5 Bealtaine agus 1 Iúil

source: Applying through the CAO: For participating higher education institutions (HEIs), you can apply online through the CAO
ga: Iarratas tríd an LOI: i gcomhair institiúidí ardoideachais rannpháirteacha, is féidir iarratas a dhéanamh ar líne tríd an CAO

source: The opening date for the 2017 online application process is 4 November 2016
ga: 'Sé 4 Samhain 2016 an dáta tosaigh i leith na bliana 2017

source: Other applications: You should apply directly to the HEI (not through the CAO) in the following cases:
ga: Iarratais eile: ba chóir duit iarratas a dhéanamh chuig an institiúid ardoideachais chuí (ní tríd an CAO) sna cásanna seo a leanas:

source: • Entry to courses at post-initial-year level
ga: • Iontráil do chúrsaí ag leibhéal níos airde ná an chéad bhliain

source: • Short duration, one-term, part-time and occasional courses
ga: • Cúrsaí gairide, téarma amháin, páirtaimseartha agus cúrsaí ócáideacha

source: • Re-admission to Dublin City University, Mary Immaculate College, Trinity College and University of Limerick
ga: • Ath-iontráil do Ollscoil Chathair Bhaile Átha Cliath, Coláiste Mhuire Gan Smál, Coláiste na Tríonóide agus Ollscoil Luimní

source: • Follow-on courses at the institutes of technology
ga: • Cúrsaí leantacha ag na hinstitiúidí teicneolaíochta

source: • Any course not mentioned in the CAO Handbook
ga: • Aon chúrsa nach luaitear i lámhleabhar an LOI

source: • Graduate/mature applicants to the Royal College of Surgeons
ga: • Céimithe/Iarrthóirí lánfhásta chuig Coláiste Ríoga na Máinlia

source: Resident outside the EU
ga: Cónaí lasmuigh den AE

source: If you are or have been resident outside the EU you may have to apply directly to some HEIs. You need to contact the admissions office of HEIs to enquire whether you should apply through the CAO or directly to the HEI
ga: Má tá tú nó má bhí tú do i do chónaí lasmuigh den AE b’fhéidir go mbeidh ort iarratas a dhéanamh go díreach chuig roinnt institiúidí ard-oideachais (IAO)

source: It is very important to check application procedures for courses since errors may be difficult or impossible to rectify
ga: Tá sé an-tábhachtach na nósanna imeachta chun iarratais a dhéanamh ar chúrsaí a sheiceáil mar d’fhéadfadh sé a bheith deacair nó dodhéanta earráidí a chur ina gceart

source: You should make your enquiries well before the closing date of 1 February, preferably not later than the previous 15 December
ga: Ba chóir duit do chuid fiosrúchán a dhéanamh i bhfad roimh dháta deiridh an 1 Feabhra, agus tráth nach déanaí ná an 15 Nollaig roimhe sin is fearr

source: Key dates for CAO applications for 2017/2018
ga: Dátaí tábhachtacha i gcomhair iarratas CAO i leith 2017/2018

source: 4 November 2016 - Online applications open at 12 noon
ga: 4 Samhain 2016: Osclaíonn an córas iarratais ar líne ag 12.00

source: 20 January 2017 - Closing date for online applications at discounted fee
ga: 20 Eanáir 2017: Dáta deiridh i gcomhair iarratas ar líne le ráta lascainithe €30

source: 1 February – Normal closing date for applications
ga: 1 Feabhra – Dáta deiridh i gcomhair ghnáth-iarratas ar líne nó ar pháipéar

source: April – Interviews and portfolio presentations for most of restricted courses*
ga: Aibreán – Agallaimh agus cur i láthair fillteán oibre i gcomhair cúrsaí teoranta*

source: 1 May – Closing date for late applications
ga: 1 Bealtaine – Dáta deiridh i gcomhair iarratas déanach

source: 5 May – Online change of mind facility opens
ga: 5 Bealtaine – Tús leis an áis athrú intinne ar líne

source: 1 July – Final date for changing your mind about course selections on your previously submitted CAO form
ga: 1 Iúil– Dáta deiridh i gcomhair athrú intinne faoi roghnú cúrsaí ar d'fhoirm CAO atá seolta isteach roimhe seo

source: Early July - Round A offers are made by the CAO (for mature students, candidates who deferred places, people who need visas and some others)
ga: Go luath i mí Iúil Iúil – Déanann an LOI tairiscintí Bhabhta A (d'iarrthóirí lánfhásta, iarrthóirí a chuir áiteanna siar, srl)

source: Early August– Round Zero offers are made by the CAO (for graduate entry medicine candidates and some other categories)
ga: Go luath i mí Iúil Lúnasa – Déanann an LOI tairiscintí Bhabhta a Neamhní (d'iarrthóirí iarchéime sa mhíochaine agus roinnt iarrthóirí eile)

source: Mid August – Leaving Certificate results come out
ga: Lúnasa – Tagann torthaí na hArdteistiméireachta amach

source: 21 August (expected date) – Round One offers are made by the CAO
ga: 21 Lúnasa (sealadach) - Déanann an CAO tairiscintí Bhabhta a hAon

source: 28 August (expected date) – Closing date for acceptance of Round One offers
ga: 28 Lúnasa (sealadach) - Dáta deiridh i gcomhair glacadh le tairiscintí Bhabhta a hAon

source: 31 August (expected date) – Round Two offers are made by the CAO
ga: 31 Lúnasa (sealadach) - Déanann an CAO tairiscintí Bhabhta a Dó

source: 6 September (expected date) – Closing date for acceptance of Round Two offers
ga: 6 Meán Fómhair (sealadach) - Dáta deiridh i gcomhair glacadh le tairiscintí Bhabhta a Dó

source: Up to 18 October – offers will be issued as necessary to fill any vacancies
ga: Suas go 18 Deireadh Fómhair - Eiseofar tairiscintí mar is riachtanach chun folúntais a líonadh

source: *Some courses are restricted application courses
ga: *Is cúrsaí iarratas teoranta iad roinnt cúrsaí

source: Such courses have early assessment procedures (sometimes as early as February) and must be mentioned in your CAO application in time for the relevant higher education institution (HEI) to arrange the procedure
ga: Tá próisis luathmheasúnaithe (amanna chomh luath le Feabhra) ag a leithéid seo de chúrsaí agus ní mór iad a lua i d' iarratas CAO in am chun go mbeidh an institiúid ard-oideachais in ann an próiseas a eagrú

source: This means that you cannot apply for such courses in a late application
ga: Ciallaíonn sé seo nach féidir leat iarratas a dhéanamh ar a leithéid seo de chúrsaí in iarratas deireanach

source: The CAO publishes a calendar of these tests and interviews
ga: Foilsíonn an CAO caileandar scrúdaithe agus agallamh anseo (pdf)
